In [ ]:
# KOMUT SATIRI OLARAK KULLANABİLİRİZ 
# BULUNDUGUMUZ KONUMU OGRENMEK ICIN

pwd

In [ ]:
# BULUNDUĞUMUZ KONUMDA  BULUNAN DOSYALARI LİSTELEMEK ICIN

ls

In [1]:
# KÜTÜPHANEMİZİ KULLANMAK İÇİN ÇAĞIRIYORUZ

import pandas as pd

In [2]:
# VEKTÖR SERİSİ TARZINDA

s = pd.Series(['banana', 42])

In [3]:
s

0    banana
1        42
dtype: object

In [4]:
# İNDEX NUMARASINA ISIM VERMEK ICIN

s = pd.Series(["pizza",42],index=["food","number"])

In [5]:
s

food      pizza
number       42
dtype: object

In [6]:
# food OLARAK NE VAR GÖRMEK İÇİN

s.loc["food"]

'pizza'

In [7]:
# SONRADAN EKLENMIS ORNEK 

s = pd.Series(['Wes', 'Creater'], index=['person', 'who'])

In [8]:
s

person        Wes
who       Creater
dtype: object

In [9]:
# person SATIRINDA NE VAR GORMEK ICIN

s.loc['person']

'Wes'

In [10]:
# SIFIRINCI SATIRDA NE VAR GORMEK ICIN

s.iloc[0]

'Wes'

In [11]:
# VERİLER SÖZLÜK OLARAK VERİLMİŞ OLDUGUNA DİKKAT EDELİM
# 
scientists=pd.DataFrame(
data={'Occupation':['Chemist','Statistician'],
'Born':['1920-07-25', '1876-06-13'],
'Died':['1958-04-16', '1937-10-16'],
'Age':[37,61]},
index=['Rosaline Franklin','William Gosset'],
columns=['Occupation', 'Born','Died','Age'])

In [12]:
scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [13]:
# VAR OLAN DOSYAYI OKUMAK ICIN BİR UST KONUM ICIN 2 NOKTA (..) 

scientists = pd.read_csv('../data/scientists.csv')

In [14]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [15]:
# Age (YAS) SUTUNUMUZUN BİLGİLERİ

scientists['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [16]:
# SADECE Age SUTUNU DEĞİŞKENE ATAMA

ages = scientists['Age']

In [17]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [18]:
# SUTUNLARI KENDİ İLE TOPLADI ( 2 KATI YANI)
# ARTI YERINE DİĞER MATEMATİKSEL İFADELER DE YAZILABİLİR

ages = scientists.Age + scientists.Age
ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [19]:
# DİGER BİR YONTEM FARKLI SUTUNDA 2 KATINI ALMAK ICIN

scientists["age_doubled"] = scientists["Age"]*2

In [20]:
scientists

,Name,Born,Died,Age,Occupation,age_doubled
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,74
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,122
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,180
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,132
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,112
5,John Snow,1813-03-15,1858-06-16,45,Physician,90
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,82
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,154

In [21]:
# DATAFRAME ÖZELLİKLERİ

In [22]:
# AGES SUTUNU TİP'İ
# Ages 2 ÇARPTIK 

type(ages)

pandas.core.series.Series

In [23]:
# ORTALAMA

ages.mean()

118.25

In [24]:
# BOYUT

ages.shape

(8,)

In [25]:
# MINUMUM

ages.min()

74

In [26]:
# BİLGİLER

ages.describe()

count      8.000000
mean     118.250000
std       36.651837
min       74.000000
25%       88.000000
50%      117.000000
75%      137.500000
max      180.000000
Name: Age, dtype: float64

In [27]:
# YAŞI ORTALAMA YAŞTAN BUYUK OLANLAR

ages[ages > ages.mean()]

1    122
2    180
3    132
7    154
Name: Age, dtype: int64

In [28]:
# PARANTEZ KULLANARAK İSTEDİĞİMİZ DEĞERLERE ERİŞİM

ages[(ages > ages.mean()) & (ages > 75)]

1    122
2    180
3    132
7    154
Name: Age, dtype: int64

In [29]:
# PARANTEZ KULLANMAZ İSEK HATALI BİR SONUC GÖRÜRÜZ

ages[ages > ages.mean() & ages > 75 ]

TypeError: cannot compare a dtyped [int64] array with a scalar of type [bool]

In [30]:
# Ages SUTUNUNDA YASI ORTALAMADAN VE 75 TEN BUYUK OLAN VAR MI KONTROLU 

ages[(ages > ages.mean()) & ~(ages > 75)]

Series([], Name: Age, dtype: int64)

In [31]:
# BİLGİLER

ages.describe()

count      8.000000
mean     118.250000
std       36.651837
min       74.000000
25%       88.000000
50%      117.000000
75%      137.500000
max      180.000000
Name: Age, dtype: float64

In [32]:
# TUM DEGERLERE +100 EKLEMEK ICIN

ages + 100

0    174
1    222
2    280
3    232
4    212
5    190
6    182
7    254
Name: Age, dtype: int64

In [33]:
scientists

,Name,Born,Died,Age,Occupation,age_doubled
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,74
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,122
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,180
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,132
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,112
5,John Snow,1813-03-15,1858-06-16,45,Physician,90
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,82
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,154

In [34]:
# YASI ORTALAMADAN BUYUK OLAN SATIRLAR

scientists[scientists['Age'] > scientists['Age'].mean()]

,Name,Born,Died,Age,Occupation,age_doubled
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,122
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,180
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,132
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,154

In [35]:
#True False KONTROLU YASI ORTALAMADAN BUYUK OLANLAR ?

scientists['Age'] > scientists['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [36]:
scientists

,Name,Born,Died,Age,Occupation,age_doubled
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,74
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,122
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,180
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,132
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,112
5,John Snow,1813-03-15,1858-06-16,45,Physician,90
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,82
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,154

In [37]:
scientists.dtypes

Name           object
Born           object
Died           object
Age             int64
Occupation     object
age_doubled     int64
dtype: object

In [38]:
# strftime
# DOGUM YILINI datetime64 FORMATINA DÖNUSTURME

born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')

In [39]:
# to_datetime NASIL KULLANILIR GÖRMEK ICIN

pd.to_datetime?

In [40]:
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [41]:
scientists['born_dt'] = born_datetime

In [42]:
# same as above
scientists['born_dt'] = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')

In [43]:
scientists

,Name,Born,Died,Age,Occupation,age_doubled,born_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,74,1920-07-25
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,122,1876-06-13
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,180,1820-05-12
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,132,1867-11-07
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,112,1907-05-27
5,John Snow,1813-03-15,1858-06-16,45,Physician,90,1813-03-15
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,82,1912-06-23
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,154,1777-04-30

In [44]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
Name           8 non-null object
Born           8 non-null object
Died           8 non-null object
Age            8 non-null int64
Occupation     8 non-null object
age_doubled    8 non-null int64
born_dt        8 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(4)
memory usage: 528.0+ bytes

In [45]:
# ÖLÜM YILINI datetime64 FORMATINA DÖNÜŞTÜRME

scientists['died_dt'] = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
scientists

,Name,Born,Died,Age,Occupation,age_doubled,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,74,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,122,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,180,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,132,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,112,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,90,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,82,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,154,1777-04-30,1855-02-23

In [46]:
scientists = scientists.drop(['Born', 'Died'], axis=1)

In [47]:
scientists

,Name,Age,Occupation,age_doubled,born_dt,died_dt
0,Rosaline Franklin,37,Chemist,74,1920-07-25,1958-04-16
1,William Gosset,61,Statistician,122,1876-06-13,1937-10-16
2,Florence Nightingale,90,Nurse,180,1820-05-12,1910-08-13
3,Marie Curie,66,Chemist,132,1867-11-07,1934-07-04
4,Rachel Carson,56,Biologist,112,1907-05-27,1964-04-14
5,John Snow,45,Physician,90,1813-03-15,1858-06-16
6,Alan Turing,41,Computer Scientist,82,1912-06-23,1954-06-07
7,Johann Gauss,77,Mathematician,154,1777-04-30,1855-02-23

In [48]:
# CSV DOSYASI HALİNE DÖNÜŞTÜRME, ÇALISTIRIRSANIZ AYNI DOSYA DİZİNİNDE CSV DOSYASI OLUŞACAKTIR

scientists.to_csv('scientists_clean.csv', index=False)

In [49]:
# CSV DOSYASINI OKUMA SEKİLLERİ

scientists = pd.read_csv('../data/scientists.csv', sep=',') # sep=',' is the default
print(scientists.head())
scientists = pd.read_csv('../data/scientists.csv')
print(scientists.head())
scientists = pd.read_csv('../data/scientists.csv', ',') # using positional argument passing for sep
print(scientists.head())

# remember you need to re-assign the 'dropped' dataframe
scientists = scientists.drop(['Born', 'Died'], axis=1)
print(scientists.head())

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist
                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist
                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist
                   Name  Age    Occupation
0     Rosaline Franklin   37       Chemist
1        William Gosset   61  Statistician
2  Florence Nightingale   90         Nurse
3           Marie Curie   66       Chemist
4         Rachel Carson   56     Biologist